; domain
(define (domain office)
    (:requirements :strips :typing :adl)
    (:types agent room item)

    (:predicates
        (neighbor ?r1 - room ?r2 - room)
        (agent_at ?a - agent ?r - room)
        (item_at ?i - item ?r - room)
        (agent_loaded ?a - agent)
        (agent_has_item ?a - agent ?i - item)
        (item_dirty ?i - item)
        (item_clean ?i - item)
        (item_is_sink ?i - item)
        
        ;; --- 汎用アフォーダンス述語 ---
        (can_graspable ?i - item)   ;; 掴むことができるか
        (can_liftable ?i - item)    ;; 持ち上げられるか（重すぎないか）
        (can_washable ?i - item)    ;; 洗浄可能か
        (can_accessible ?i - item)  ;; アクセス可能か（以前の item_accessible）
    )

    ;; 移動アクション
    (:action goto
        :parameters (?a - agent ?r1 - room ?r2 - room)
        :precondition (and (agent_at ?a ?r1) (neighbor ?r1 ?r2))
        :effect (and (not (agent_at ?a ?r1)) (agent_at ?a ?r2))
    )

    ;; 拾い上げアクション
    (:action pick
        :parameters (?a - agent ?i - item ?r - room)
        :precondition (and 
            (agent_at ?a ?r) 
            (item_at ?i ?r) 
            (can_accessible ?i)   ;; 障害物がない
            (can_graspable ?i)    ;; アフォーダンス：掴める形状か
            (can_liftable ?i)     ;; アフォーダンス：持ち上がる重さか
            (not (agent_loaded ?a))
        )
        :effect (and 
            (not (item_at ?i ?r)) 
            (agent_loaded ?a) 
            (agent_has_item ?a ?i)
        )
    )

    ;; 配置アクション
    (:action drop
        :parameters (?a - agent ?i - item ?r - room)
        :precondition (and (agent_at ?a ?r) (agent_has_item ?a ?i))
        :effect (and 
            (item_at ?i ?r) 
            (not (agent_loaded ?a)) 
            (not (agent_has_item ?a ?i))
        )
    )

    ;; 洗浄アクション
    (:action wash
        :parameters (?a - agent ?i - item ?s - item ?r - room)
        :precondition (and 
            (agent_at ?a ?r) 
            (item_at ?s ?r) 
            (item_is_sink ?s) 
            (agent_has_item ?a ?i) 
            (item_dirty ?i)
            (can_washable ?i)     ;; アフォーダンス：水で洗っても壊れないか
        )
        :effect (and 
            (not (item_dirty ?i)) 
            (item_clean ?i)
        )
    )
)

; problem
(define (problem fix_scene)
  (:domain office)
  (:objects
    agent1 - agent
    room_initial room_target - room
    bottle_0 bottle_1 bottle_2 bottle_3 bottle_4 - item
  )
  (:init
    (agent_at agent1 room_initial)
    (neighbor room_initial room_target)
    (neighbor room_target room_initial)
    (item_at bottle_0 room_initial)
    (item_at bottle_1 room_initial)
    (item_at bottle_2 room_initial)
    (item_at bottle_3 room_initial)
    (item_at bottle_4 room_initial)
    (can_accessible bottle_0)
    (can_graspable bottle_0)
    (can_liftable bottle_0)
    (can_accessible bottle_1)
    (can_graspable bottle_1)
    (can_liftable bottle_1)
    (can_accessible bottle_2)
    (can_graspable bottle_2)
    (can_liftable bottle_2)
    (can_accessible bottle_3)
    (can_graspable bottle_3)
    (can_liftable bottle_3)
    (can_accessible bottle_4)
    (can_graspable bottle_4)
    (can_liftable bottle_4)
  )
  (:goal (and (item_at bottle_0 room_target)
    (item_at bottle_1 room_target)
    (item_at bottle_2 room_target)
    (item_at bottle_3 room_target)
    (item_at bottle_4 room_target)))
)

; plan
1. (pick agent1 bottle_0 room_initial)
   deleted: (item_at bottle_0 room_initial)
   added: (agent_loaded agent1) (agent_has_item agent1 bottle_0)
   goals met: 0 of 5
2. (goto agent1 room_initial room_target)
   deleted: (agent_at agent1 room_initial)
   added: (agent_at agent1 room_target)
   goals met: 0 of 5
3. (drop agent1 bottle_0 room_target)
   deleted: (agent_loaded agent1) (agent_has_item agent1 bottle_0)
   added: (item_at bottle_0 room_target)
   goals met: 1 of 5
4. (goto agent1 room_target room_initial)
   deleted: (agent_at agent1 room_target)
   added: (agent_at agent1 room_initial)
   goals met: 1 of 5
5. (pick agent1 bottle_1 room_initial)
   deleted: (item_at bottle_1 room_initial)
   added: (agent_loaded agent1) (agent_has_item agent1 bottle_1)
   goals met: 1 of 5
6. (goto agent1 room_initial room_target)
   deleted: (agent_at agent1 room_initial)
   added: (agent_at agent1 room_target)
   goals met: 1 of 5
7. (drop agent1 bottle_1 room_target)
   deleted: (agent_loaded agent1) (agent_has_item agent1 bottle_1)
   added: (item_at bottle_1 room_target)
   goals met: 2 of 5
8. (goto agent1 room_target room_initial)
   deleted: (agent_at agent1 room_target)
   added: (agent_at agent1 room_initial)
   goals met: 2 of 5
9. (pick agent1 bottle_2 room_initial)
   deleted: (item_at bottle_2 room_initial)
   added: (agent_loaded agent1) (agent_has_item agent1 bottle_2)
   goals met: 2 of 5
10. (goto agent1 room_initial room_target)
   deleted: (agent_at agent1 room_initial)
   added: (agent_at agent1 room_target)
   goals met: 2 of 5
11. (drop agent1 bottle_2 room_target)
   deleted: (agent_loaded agent1) (agent_has_item agent1 bottle_2)
   added: (item_at bottle_2 room_target)
   goals met: 3 of 5
12. (goto agent1 room_target room_initial)
   deleted: (agent_at agent1 room_target)
   added: (agent_at agent1 room_initial)
   goals met: 3 of 5
13. (pick agent1 bottle_3 room_initial)
   deleted: (item_at bottle_3 room_initial)
   added: (agent_loaded agent1) (agent_has_item agent1 bottle_3)
   goals met: 3 of 5
14. (goto agent1 room_initial room_target)
   deleted: (agent_at agent1 room_initial)
   added: (agent_at agent1 room_target)
   goals met: 3 of 5
15. (drop agent1 bottle_3 room_target)
   deleted: (agent_loaded agent1) (agent_has_item agent1 bottle_3)
   added: (item_at bottle_3 room_target)
   goals met: 4 of 5
16. (goto agent1 room_target room_initial)
   deleted: (agent_at agent1 room_target)
   added: (agent_at agent1 room_initial)
   goals met: 4 of 5
17. (pick agent1 bottle_4 room_initial)
   deleted: (item_at bottle_4 room_initial)
   added: (agent_loaded agent1) (agent_has_item agent1 bottle_4)
   goals met: 4 of 5
18. (goto agent1 room_initial room_target)
   deleted: (agent_at agent1 room_initial)
   added: (agent_at agent1 room_target)
   goals met: 4 of 5
19. (drop agent1 bottle_4 room_target)
   deleted: (agent_loaded agent1) (agent_has_item agent1 bottle_4)
   added: (item_at bottle_4 room_target)
   goals met: 5 of 5
